{"backend": "tensorflow", "keras_version": "2.1.3", "config": [{"config": {"layer": {"config": {"dropout": 0.0, "return_sequences": true, "activation": "tanh", "bias_constraint": null, "recurrent_constraint": null, "implementation": 1, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "kernel_regularizer": null, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "trainable": true, "name": "gru_1", "use_bias": true, "recurrent_regularizer": null, "stateful": false, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 200, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "GRU"}, "trainable": true, "batch_input_shape": [null, 20, 336], "dtype": "float32", "name": "bidirectional_1", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"rate": 0.8, "noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "bidirectional_2", "trainable": true, "layer": {"config": {"dropout": 0.0, "return_sequences": false, "activation": "tanh", "bias_constraint": null, "recurrent_constraint": null, "implementation": 1, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "kernel_regularizer": null, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "trainable": true, "name": "gru_2", "use_bias": true, "recurrent_regularizer": null, "stateful": false, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 200, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "GRU"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"rate": 0.8, "noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 100, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_1", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}