{"class_name": "Sequential", "keras_version": "2.1.3", "backend": "tensorflow", "config": [{"class_name": "Bidirectional", "config": {"name": "bidirectional_33", "trainable": true, "batch_input_shape": [null, 20, 345], "dtype": "float32", "merge_mode": "concat", "layer": {"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "trainable": true, "dropout": 0.0, "recurrent_constraint": null, "return_state": false, "implementation": 1, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "gru_9", "kernel_regularizer": null, "return_sequences": true, "recurrent_regularizer": null, "activation": "tanh", "unroll": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "stateful": false, "units": 100, "bias_constraint": null, "kernel_constraint": null, "go_backwards": false}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.8, "name": "dropout_31", "trainable": true, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_34", "merge_mode": "concat", "layer": {"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "trainable": true, "dropout": 0.0, "recurrent_constraint": null, "return_state": false, "implementation": 1, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "gru_10", "kernel_regularizer": null, "return_sequences": false, "recurrent_regularizer": null, "activation": "tanh", "unroll": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "stateful": false, "units": 100, "bias_constraint": null, "kernel_constraint": null, "go_backwards": false}}, "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.8, "name": "dropout_32", "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "units": 105, "name": "dense_18", "trainable": true, "kernel_regularizer": null}}]}